package com.clearpole.videoyoux.logic.utils

import com.blankj.utilcode.util.TimeUtils

class ColorEggDate {
    companion object {
        fun string(): String {
            return when (TimeUtils.getChineseWeek(TimeUtils.getNowDate())) {
                "周日" -> {
                    when ((0..4).random()) {
                        0 -> "痛苦要降临了😭"
                        1 -> "工作做了吗❓"
                        2 -> "最后一天的放飞✈"
                        3 -> "天气如何？"
                        else -> "想要播放什么吗？"
                    }
                }

                "周六" -> {
                    when ((0..4).random()) {
                        0 -> "出去玩吧！🐾"
                        1 -> "风景正好！🪸"
                        2 -> "哈哈哈哈哈✌"
                        3 -> "没事，还有一天时间~"
                        else -> "看中哪个了？"
                    }
                }

                "周五" -> {
                    when ((0..4).random()) {
                        0 -> "坚持即胜利✌"
                        1 -> "过得真快🌎"
                        2 -> "还不如直接放假🤦‍♂️"
                        3 -> "再摆一天就好了（倒"
                        else -> "第几集来着？"
                    }
                }

                "周四" -> {
                    when ((0..4).random()) {
                        0 -> "怎么还有一天？！"
                        1 -> "坚定决心！😁"
                        2 -> "亚历山大😨"
                        3 -> "好像看到了点光？😎"
                        else -> "怎么还不更新？"
                    }
                }

                "周三" -> {
                    when ((0..4).random()) {
                        0 -> "一半一半嘛😍"
                        1 -> "动力加持中🐣"
                        2 -> "驼峰日快乐😆"
                        3 -> "耐力赛而已😎"
                        else -> "好无聊啊"
                    }
                }

                "周二" -> {
                    when ((0..4).random()) {
                        0 -> "稳步推进ing😣"
                        1 -> "失去梦想的咸鱼"
                        2 -> "想重开了家人们🥴"
                        3 -> "疲惫不堪🫠"
                        else -> "在哪个文件夹来着..."
                    }
                }

                "周一" -> {
                    when ((0..4).random()) {
                        0 -> "卷死我了🐔"
                        1 -> "/RESTART"
                        2 -> "加油💪加油💪加油"
                        3 -> "周一忧郁症😶‍🌫️"
                        else -> "开看！"
                    }
                }

                else -> "美好的一天💕"
            }
        }
    }
}